CSI API ETABS v1
cAnalyze.SetSolverOption_2 Method
 Sets the model solver options.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetSolverOption_2(
	int SolverType,
	int SolverProcessType,
	int NumberParallelRuns,
	string StiffCase = ""
)
Function SetSolverOption_2 (
	SolverType As Integer,
	SolverProcessType As Integer,
	NumberParallelRuns As Integer,
	Optional StiffCase As String = ""
) As Integer
Dim instance As cAnalyze
Dim SolverType As Integer
Dim SolverProcessType As Integer
Dim NumberParallelRuns As Integer
Dim StiffCase As String
Dim returnValue As Integer
returnValue = instance.SetSolverOption_2(SolverType,
	SolverProcessType, NumberParallelRuns,
	StiffCase)
int SetSolverOption_2(
	int SolverType,
	int SolverProcessType,
	int NumberParallelRuns,
	String^ StiffCase = L""
)
abstract SetSolverOption_2 :
        SolverType : int *
        SolverProcessType : int *
        NumberParallelRuns : int *
        ?StiffCase : string
(* Defaults:
        let _StiffCase = defaultArg StiffCase ""
*)
-> int
Parameters
SolverType
Type: System.Int32
 This is 0, 1 or 2, indicating the solver type.
0 = Standard solver
1 = Advanced solver
2 = Multi-threaded solver
SolverProcessType
Type: System.Int32
 This is 0, 1 or 2, indicating the process the analysis is run.
0 = Auto (program determined)
1 = GUI process
2 = Separate process
NumberParallelRuns
Type: System.Int32
 This is an integer not including -1.
-Less than -1 = Auto parallel (use up to all physical cores - limited by license). Treated the same as 0.
-1 = Illegal value; will return an error
0 = Auto parallel (use up to all physical cores)
1 = Serial
Greater than 1 = User defined parallel (use up to this fixed number of cores - limited by license)
StiffCase (Optional)
Type: System.String
 The name of the load case used when outputting the mass and stiffness matrices to text files. If this item is blank, no matrices are output.
Return Value
Type: Int32
 Returns zero if the options are successfully set; otherwise it returns a nonzero value.
Remarks
 '''
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'set model solver options
       ret = SapModel.Analyze.SetSolverOption_2(1, 1, 3, "DEAD")
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cAnalyze Interface
ETABSv1 Namespace